# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'coreutils'
brew 'docker'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'jq'
brew 'mas' # Mac App Store manager
brew 'neonctl'
brew 'nvm'
brew 'opentofu'
brew 'pinentry-mac'
brew 'postgresql@17'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'terraformer'
brew 'terragrunt'

# Apps
cask '1password'
cask '1password-cli'
cask 'affinity-designer'
cask 'affinity-photo'
cask 'affinity-publisher'
cask 'bruno'
cask 'chromium'
cask 'discord'
cask 'firefox'
cask 'firefox@developer-edition'
cask 'google-chrome'
cask 'gpg-suite-no-mail'
cask 'imageoptim'
cask 'iterm2'
cask 'monitorcontrol'
cask 'skype'
cask 'sourcetree'
cask 'vial'
cask 'visual-studio-code'
cask 'zoom'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'NepTunes', id: 1006739057
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Photomator', id: 1444636541
mas 'Sim Daltonism', id: 693112260
