# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'coreutils'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'httpie'
brew 'jq'
brew 'mas' # Mac App Store manager
brew 'nvm'
brew 'opentofu'
brew 'pinentry-mac'
brew 'ssh-copy-id'
brew 'terraformer'
brew 'terragrunt'

# Apps
cask '1password'
cask 'discord'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'imageoptim'
cask 'visual-studio-code'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'NepTunes', id: 1006739057
mas 'Numbers', id: 409203825
mas 'NordVPN', id: 905953485
mas 'Pages', id: 409201541
mas 'Sim Daltonism', id: 693112260
