# Fonts
cask 'font-fira-code'
cask 'font-source-sans-3'
cask 'font-source-serif-4'

# Drivers
cask 'wacom-tablet'

# Binaries
brew 'coreutils'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'jq'
brew 'mas' # Mac App Store manager
brew 'micro'
brew 'nvm'
brew 'oh-my-posh'
brew 'opentofu'
brew 'pinentry-mac'
brew 'postgresql@17'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'terraformer'
brew 'terragrunt'

# Apps
cask '1password'
cask '1password-cli'
cask 'affinity-designer'
cask 'affinity-photo'
cask 'affinity-publisher'
cask 'betterdisplay'
cask 'bruno'
cask 'chromium'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'firefox@developer-edition'
cask 'ghostty'
cask 'google-chrome'
cask 'gpg-suite-no-mail'
cask 'imageoptim'
cask 'obsidian'
cask 'skype'
cask 'sourcetree'
cask 'vial'
cask 'visual-studio-code'
cask 'zoom'

# Mac App Store
mas 'AusweisApp Bund', id: 948660805
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'NepTunes', id: 1006739057
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Photomator', id: 1444636541
mas 'Sim Daltonism', id: 693112260
